# DataFrames in Pandas

Adding columns, deleting columns, and slicing data in Pandas

In [2]:
import pandas as pd
import numpy as np

In [3]:
col1 = [100, 200]  # a list
col2=['M', 'F']
col3=['John', 'Mary']

# a dictionary
data = { 'c1' : col1,
         'c2' : col2,
         'c3' : col3 
       }

# Create dataframe
df = pd.DataFrame(data)
df.columns = ['col1', 'col2', 'col3']

df

   col1 col2  col3
0   100    M  John
1   200    F  Mary

Applying a function to every row in a column and write the outputs to a new column.

In [4]:
def myfunction(x):
    if x == 'M':
        return 'Male'
    else:
        return 'Female'
    
df["col2_full"] = df.col2.apply(myfunction)

df

   col1 col2  col3 col2_full
0   100    M  John      Male
1   200    F  Mary    Female

Deleting a column from a DataFrame.

In [5]:
del df["col2_full"]

df

   col1 col2  col3
0   100    M  John
1   200    F  Mary

Adding a new column into a DataFrame.

In [6]:
df['NewCol'] = 6

df

   col1 col2  col3  NewCol
0   100    M  John       6
1   200    F  Mary       6

In [7]:
del df['NewCol']

df

   col1 col2  col3
0   100    M  John
1   200    F  Mary

Displaying the index of a DataFrame. Our DataFrame only has two rows, and the two indices are 0 and 1.

In [8]:
df.index  # index (row labels) of the DataFrame.

RangeIndex(start=0, stop=2, step=1)

The values for 'columns' and 'index' in a DataFrame can be changed as shown.

In [9]:
df.index = ['a', 'b']  # change the name of the index                
df.columns =['Credit', 'Gender', 'Name'] # change the name of the column

df

   Credit Gender  Name
a     100      M  John
b     200      F  Mary

Accessing the content of a DataFrame by zero-based indicing.

In [10]:
# iloc - integer-location based indexing for selection by position
df.iloc [0]   #  row 0

Credit     100
Gender       M
Name      John
Name: a, dtype: object

Use DF[A, B] to retrieve the Ath row and Bth column of a DataFrame DF.

In [11]:
df.iloc[0, 1] # row 0, column 1

'M'

Retrieves rows starting from row 0 to 2 (non-inclusive).

In [12]:
df.iloc[:2]  # slicing  - row 0 to row 1

   Credit Gender  Name
a     100      M  John
b     200      F  Mary

Retrieves all rows starting from row 0 to 2 (non-inclusive) and all columns.

In [13]:
df.iloc[:2, :]  # slicing  - row 0 to row 1

   Credit Gender  Name
a     100      M  John
b     200      F  Mary

Retrieves rows starting from row 0 to 2 (non-inclusive) and columns from column 0 to 3 (non-inclusive).

In [14]:
df.iloc[:2, 1:3]  # slicing  - row 0 to row 1, column 1 to 2

  Gender  Name
a      M  John
b      F  Mary

Retrieves rows starting from row 0 to 5 (non-inclusive) and columns from column 1 to 5 (non-inclusive).

In [15]:
df.iloc[:5, 1:5] # slice indexers which allow out-of-bounds indexing

  Gender  Name
a      M  John
b      F  Mary

Accessing data by labels in a DataFrame using 'loc()'. Below, we specify the start and end index values of the corresponding rows to be retrieved.

In [16]:
df.loc['a':'b']  # loc - access by label(s). Note: iloc - is integer-based access

   Credit Gender  Name
a     100      M  John
b     200      F  Mary

Accessing non-existent labels does not constitute to a crash.

In [17]:
df.loc['a':'d']

   Credit Gender  Name
a     100      M  John
b     200      F  Mary

Returning a Series from a DataFrame by specifying the Column name (without using 'loc()').

In [18]:
x = df['Credit']

x.loc['a':'b']

a    100
b    200
Name: Credit, dtype: int64

Returning a DataFrame that only has one column.

In [19]:
df[['Credit']]

   Credit
a     100
b     200

Returning a subset of a DataFrame by providing the required column-names.

In [20]:
df[['Credit', 'Gender']]

   Credit Gender
a     100      M
b     200      F

Adding rows to the DataFrame.

In [21]:
df.loc['c'] = ['50', 'M', 'James']
df.loc['d'] = ['150', 'F', 'Lynn']
df.loc['e'] = ['120', 'F', 'Jean']
df.loc['f'] = ['80', 'F', 'Lisa']
df.loc['g'] = ['100', 'M', 'Jordan']

df

  Credit Gender    Name
a    100      M    John
b    200      F    Mary
c     50      M   James
d    150      F    Lynn
e    120      F    Jean
f     80      F    Lisa
g    100      M  Jordan

Displaying the first 5 rows of a DataFrame.

In [22]:
df.head()

  Credit Gender   Name
a    100      M   John
b    200      F   Mary
c     50      M  James
d    150      F   Lynn
e    120      F   Jean

Displaying the last 5 rows of a DataFrame.

In [23]:
df.tail()

  Credit Gender    Name
c     50      M   James
d    150      F    Lynn
e    120      F    Jean
f     80      F    Lisa
g    100      M  Jordan

Let's now create a DataFrame and try to query its data. 'np.nan' means Not A Number, which is used as a substitute for values that are missing from the original dataset.

In [24]:
students = { 
  'name': ['Jennifer', 'Lawrence', 'Harry', 'Tom'],
  'age': [10, 10, 11, 12],
  'marks': [70, 80, 80, np.nan],
  'level': ['1', '1', '2', '2']
}

df2 = pd.DataFrame(students)

df2

       name  age  marks level
0  Jennifer   10   70.0     1
1  Lawrence   10   80.0     1
2     Harry   11   80.0     2
3       Tom   12    NaN     2

We can get back a row of booleans (True or False) by querying against a column in a DataFrame.

In [25]:
#  checks for which rows the Age column has a value larger than 10
df2['age'] > 10

0    False
1    False
2     True
3     True
Name: age, dtype: bool

Placing the above array of booleans (Trues and Falses) into the DataFrame returns rows that correspond to True.

In [26]:
df2[df2['age'] > 10]

    name  age  marks level
2  Harry   11   80.0     2
3    Tom   12    NaN     2

Similarly, using the above technique, we get all rows whose 'age' column has a value less than 11 or greater than 11. Notice that row with index 2 is excluded because that row corresponds to a False for the provided condition.

In [27]:
# select a number of rows
df2 [(df2['age'] < 11) | (df2['age'] > 11)  ]

       name  age  marks level
0  Jennifer   10   70.0     1
1  Lawrence   10   80.0     1
3       Tom   12    NaN     2

Using the same technique to fetch rows based on a condition (i.e. values of 'age' cloumns that are greater than 10), but specifying only a subset of the columns.

In [28]:
# select a number of rows and interested only in a specific columns
df_old = df2.loc[df2['age'] > 10, ['name', 'age']]

df_old

    name  age
2  Harry   11
3    Tom   12

Below, isnull() returns a Pandas Series of True/False with respect to a column in a DataFrame. If any row of that column has a NaN value, the corresponding row in the Pandas Series will be True.

In [40]:
df2['marks'].isnull()

0    False
1    False
2    False
3     True
Name: marks, dtype: bool

DataFrame returns rows that correspond to True values in the Pandas Series. The last row of the DataFrame is returned as only the last row in the Pandas Series has a True value.

In [37]:
# extract those rows with missing marks 
df_missing_marks = df2[(df2['marks'].isnull())]

df_missing_marks

  name  age  marks level
3  Tom   12    NaN     2

The notnull(), when applied to a column in a DataFrame, has a True in the returned Pandas Series when the corresponding row does not have a NaN value.

In [39]:
df2['marks'].notnull()

0     True
1     True
2     True
3    False
Name: marks, dtype: bool

We can then fetch rows in the DataFrame that correspond to a True value in the above Pandas Series.

In [42]:
# extract those rows with marks 
# notnull() : detect existing (non-missing) values.
df_new = df2[(df2['marks'].notnull()) ]

df_new

       name  age  marks level
0  Jennifer   10   70.0     1
1  Lawrence   10   80.0     1
2     Harry   11   80.0     2